# This is a file written in Emacs and authored using org-mode (http://orgmode.org/)
# The "README.md" file is generated from this file by running the
# "M-x org-md-export-to-markdown" command from inside of Emacs.
# 
# The rest of the files are generated from this file by running the
# "M-x org-babel-tangle" command from inside of Emacs.
# 
# The options below control the behavior of org-md-export-to-markdown:
#
# Don't render a Table of Contents 
#+OPTIONS: toc:nil
# Don't render section numbers
#+OPTIONS: num:nil
# Turn of subscript parsing: http://super-user.org/wordpress/2012/02/02/how-to-get-rid-of-subscript-annoyance-in-org-mode/comment-page-1/
#+OPTIONS: ^:{}
* Dependencies
  This script depends on the command line tools listed below. These
  requirements should be automatically included via the =nix-shell=
  directives in the script, but are listed below for the sake of
  completeness.

  #+BEGIN_SRC python :var table=requirements-table :results html :noweb yes :cache yes :exports results
    data = <<table-to-dict(requirements-table)>>
    output = "| Name | Version | Description | License |\n"
    output += "| ---- | --- | --- | --- |\n"
    for package in data:
	if not package['name']:
	    continue
	output += "| [{name}]({url}) | {version} | {description} | [{license}]({license_url}) |\n".format(**package)
    return output
  #+END_SRC

  #+RESULTS[21410f6bab71a6d5ee137e1b250f3cc75f6f161b]:
  #+BEGIN_HTML
  | Name | Version | Description | License |
  | ---- | --- | --- | --- |
  | [curl](https://curl.haxx.se/) | 7.47.1 | Command line tool for transferring data with URL syntax | [MIT/X](https://curl.haxx.se/docs/copyright.html) |
  | [jq](https://stedolan.github.io/jq/) | 1.5 | A lightweight and flexible command-line JSON processor | [MIT](https://github.com/stedolan/jq/blob/master/COPYING) |
  #+END_HTML

